Revit 2027 API
WallUtils Class
 General Wall utility methods
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WallUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class WallUtils
Public NotInheritable Class WallUtils
public ref class WallUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallUtils = class end
The WallUtils type exposes the following members.
Methods
Name | Description
AllowWallJoinAtEnd |  Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result.
DisallowWallJoinAtEnd |  Sets the wall's end not to join to other walls.
IsWallJoinAllowedAtEnd |  Identifies if the indicated end of the wall allows joins or not.
Top
See Also
Reference
Autodesk.Revit.DB Namespace